### Report for project: `terraform`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```diff


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.api.aws_ecs_task_definition.default[0] has changed
  ~ resource "aws_ecs_task_definition" "default" {
        id                       = "gost-prod-api"
+       tags                     = {}
        # (13 unchanged attributes hidden)

+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id          = "fs-0b22d749517d906e0"
+               root_directory          = "/"
+               transit_encryption      = "ENABLED"
+               transit_encryption_port = 0

+               authorization_config {
+                   access_point_id = "fsap-05cdce2f27f5aab98"
                }
            }
        }
-       volume {
-           name = "data" -> null

-           efs_volume_configuration {
-               file_system_id     = "fs-0b22d749517d906e0" -> null
-               root_directory     = "/" -> null
-               transit_encryption = "ENABLED" -> null

-               authorization_config {
-                   access_point_id = "fsap-05cdce2f27f5aab98" -> null
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.api.aws_iam_role.execution[0] has changed
  ~ resource "aws_iam_role" "execution" {
        id                    = "gost-prod-api-ECSTaskExecution-20230303023921815800000009"
        name                  = "gost-prod-api-ECSTaskExecution-20230303023921815800000009"
      ~ role_last_used        = [
          ~ {
              ~ last_used_date = "2023-07-18T17:45:30Z" -> "2023-09-14T22:57:54Z"
                # (1 unchanged element hidden)
            },
        ]
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.api.aws_iam_role.task[0] has changed
  ~ resource "aws_iam_role" "task" {
        id                    = "gost-prod-api-ECSTask-2023030302392200850000000a"
        name                  = "gost-prod-api-ECSTask-2023030302392200850000000a"
      ~ role_last_used        = [
          ~ {
              ~ last_used_date = "2023-07-18T17:20:48Z" -> "2023-09-14T23:51:30Z"
                # (1 unchanged element hidden)
            },
        ]
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.module.efs_data_volume.aws_efs_file_system.default[0] has changed
  ~ resource "aws_efs_file_system" "default" {
        id                              = "fs-0b22d749517d906e0"
      ~ size_in_bytes                   = [
          ~ {
              ~ value             = 3787491328 -> 4352432128
              ~ value_in_standard = 3787491328 -> 4352432128
                # (1 unchanged element hidden)
            },
        ]
        tags                            = {
            "Name"      = "gost-prod-gost-prod-datavolume"
            "Namespace" = "gost-prod"
        }
        # (11 unchanged attributes hidden)
    }

  # module.api.module.grants_scraper.aws_iam_role.default[0] has changed
  ~ resource "aws_iam_role" "default" {
        id                    = "gost-prod-grants_scraper-2023030302392250420000000b"
        name                  = "gost-prod-grants_scraper-2023030302392250420000000b"
      ~ role_last_used        = [
          ~ {
              ~ last_used_date = "2023-07-18T05:36:22Z" -> "2023-09-14T05:36:22Z"
                # (1 unchanged element hidden)
            },
        ]
        tags                  = {}
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.api.aws_ecs_service.default[0] will be updated in-place
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:us-west-2:729134339726:service/gost-prod/gost-prod-api"
        name                               = "gost-prod-api"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-api:9" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_ecs_task_definition.default[0] must be replaced
+/- resource "aws_ecs_task_definition" "default" {
      ~ arn                      = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-api:9" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-api" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
+                   dependsOn              = [
+                       {
+                           condition     = "START"
+                           containerName = "datadog"
                        },
                    ]
                  ~ dockerLabels           = {
                      ~ "com.datadoghq.tags.version" = "10aa6583edb08e63624c218f2a8a4aee4611a1b8" -> "d1c7807c1013cba2b0ba55b8f0abfebde8edf384"
                        # (2 unchanged elements hidden)
                    }
                  ~ environment            = [
                        # (3 unchanged elements hidden)
                        {
                            name  = "DD_ENV"
                            value = "production"
                        },
+                       {
+                           name  = "DD_PROFILING_ENABLED"
+                           value = "true"
                        },
                        {
                            name  = "DD_SERVICE"
                            value = "gost"
                        },
                      ~ {
                            name  = "DD_VERSION"
                          ~ value = "10aa6583edb08e63624c218f2a8a4aee4611a1b8" -> "d1c7807c1013cba2b0ba55b8f0abfebde8edf384"
                        },
                        {
                            name  = "ENABLE_GRANTS_DIGEST"
                            value = "true"
                        },
                        {
                            name  = "ENABLE_GRANTS_SCRAPER"
                            value = "false"
                        },
+                       {
+                           name  = "ENABLE_SAVED_SEARCH_GRANTS_DIGEST"
+                           value = "false"
                        },
                        {
                            name  = "GRANTS_SCRAPER_DATE_RANGE"
                            value = "7"
                        },
                        # (6 unchanged elements hidden)
                    ]
                    name                   = "api"
-                   volumesFrom            = [] -> null
                    # (9 unchanged elements hidden)
                } # forces replacement,
              ~ {
                  ~ dockerLabels           = {
                      ~ "com.datadoghq.tags.version" = "10aa6583edb08e63624c218f2a8a4aee4611a1b8" -> "d1c7807c1013cba2b0ba55b8f0abfebde8edf384"
                        # (2 unchanged elements hidden)
                    }
                  ~ environment            = [
                        # (1 unchanged element hidden)
                        {
                            name  = "DD_ENV"
                            value = "production"
                        },
+                       {
+                           name  = "DD_PROFILING_ENABLED"
+                           value = "true"
                        },
                        {
                            name  = "DD_SERVICE"
                            value = "gost"
                        },
                      ~ {
                            name  = "DD_VERSION"
                          ~ value = "10aa6583edb08e63624c218f2a8a4aee4611a1b8" -> "d1c7807c1013cba2b0ba55b8f0abfebde8edf384"
                        },
                        {
                            name  = "ECS_FARGATE"
                            value = "true"
                        },
                    ]
-                   mountPoints            = [] -> null
                    name                   = "datadog"
-                   portMappings           = [] -> null
-                   volumesFrom            = [] -> null
                    # (6 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "gost-prod-api" -> (known after apply)
      ~ revision                 = 9 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

-       volume {
-           name = "data" -> null

-           efs_volume_configuration {
-               file_system_id          = "fs-0b22d749517d906e0" -> null
-               root_directory          = "/" -> null
-               transit_encryption      = "ENABLED" -> null
-               transit_encryption_port = 0 -> null

-               authorization_config {
-                   access_point_id = "fsap-05cdce2f27f5aab98" -> null
                }
            }
        }
+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id     = "fs-0b22d749517d906e0"
+               root_directory     = "/"
+               transit_encryption = "ENABLED"

+               authorization_config {
+                   access_point_id = "fsap-05cdce2f27f5aab98"
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.consume_grants.aws_ecs_service.default will be updated in-place
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:us-west-2:729134339726:service/gost-prod/gost-prod-consume_grants"
        name                               = "gost-prod-consume_grants"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-consume_grants:3" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.consume_grants.aws_ecs_task_definition.consume_grants must be replaced
+/- resource "aws_ecs_task_definition" "consume_grants" {
      ~ arn                      = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-consume_grants:3" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-consume_grants" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "gost-prod-consume_grants" -> (known after apply)
-       ipc_mode                 = "" -> null
-       pid_mode                 = "" -> null
      ~ revision                 = 3 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.website.aws_s3_object.deploy-config[0] will be updated in-place
  ~ resource "aws_s3_object" "deploy-config" {
      ~ content                = <<-EOT
            window.APP_CONFIG = window.APP_CONFIG || {};
-           window.apiURLForGOST = https://api.grants.usdigitalresponse.org/;
-           window.APP_CONFIG.UseNewTable = false;
+           window.APP_CONFIG.apiURLForGOST = https://api.grants.usdigitalresponse.org/;
+           window.apiURLForGOST = window.APP_CONFIG.apiURLForGOST; // Legacy
+           window.APP_CONFIG.featureFlags = {"useNewTable":false};
+           
+           window.APP_CONFIG.overrideFeatureFlag = (flagName, overrideValue) => {
+             const storageKey = featureFlags;
+             let overrides = {};
+             try {
+               overrides = JSON.parse(window.sessionStorage.getItem(storageKey)) || {};
+             } catch (e) {
+               console.error(`Error parsing window.sessionStorage.${storageKey} as JSON:`, e);
+               console.warn(`window.sessionStorage.${storageKey} will be replaced.`);
+             }
+             overrides[flagName] = overrideValue;
+             window.sessionStorage.setItem(storageKey, JSON.stringify(overrides));
+             console.log(New feature flag overrides in page session:,
+               window.sessionStorage.getItem(storageKey));
+           };
        EOT
      ~ etag                   = "44dd8bd44825e9b763729ec64bf17452" -> "d377638f1e36efb35da2c71b90f32e64"
        id                     = "/config/deploy-config.js"
        tags                   = {}
      ~ version_id             = "WIzW6gY9.gLyXSd.IPmF7zJXHxkqpIb1" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.api.module.grants_scraper.data.aws_iam_policy_document.permissions[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "permissions" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "ecs:RunTask",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "AllowRunTask"

+           condition {
+               test     = "ArnLike"
+               values   = [
+                   "arn:aws:ecs:us-west-2:729134339726:cluster/gost-prod",
                ]
+               variable = "ecs:cluster"
            }
        }
+       statement {
+           actions   = [
+               "iam:PassRole",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:iam::729134339726:role/gost-prod-api-ECSTask-2023030302392200850000000a",
+               "arn:aws:iam::729134339726:role/gost-prod-api-ECSTaskExecution-20230303023921815800000009",
            ]
+           sid       = "AllowSchedulerPassRoleToExecutionRole"
        }
    }

  # module.api.module.grants_scraper.aws_iam_role_policy.default[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "default" {
        id     = "gost-prod-grants_scraper-2023030302392250420000000b:terraform-20230303024046969200000014"
        name   = "terraform-20230303024046969200000014"
      ~ policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "ecs:RunTask"
-                       Condition = {
-                           ArnLike = {
-                               "ecs:cluster" = "arn:aws:ecs:us-west-2:729134339726:cluster/gost-prod"
                            }
                        }
-                       Effect    = "Allow"
-                       Resource  = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-api:*"
-                       Sid       = "AllowRunTask"
                    },
-                   {
-                       Action   = "iam:PassRole"
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:iam::729134339726:role/gost-prod-api-ECSTaskExecution-20230303023921815800000009",
-                           "arn:aws:iam::729134339726:role/gost-prod-api-ECSTask-2023030302392200850000000a",
                        ]
-                       Sid      = "AllowSchedulerPassRoleToExecutionRole"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.api.module.grants_scraper.aws_scheduler_schedule.default[0] will be updated in-place
  ~ resource "aws_scheduler_schedule" "default" {
        id                           = "default/gost-prod-grants_scraper-20230303024046967600000013"
        name                         = "gost-prod-grants_scraper-20230303024046967600000013"
        # (10 unchanged attributes hidden)

      ~ target {
            # (3 unchanged attributes hidden)

          ~ ecs_parameters {
                tags                    = {}
              ~ task_definition_arn     = "arn:aws:ecs:us-west-2:729134339726:task-definition/gost-prod-api:9" -> (known after apply)
                # (8 unchanged attributes hidden)

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.website.module.waf.aws_wafv2_web_acl.default[0] will be updated in-place
  ~ resource "aws_wafv2_web_acl" "default" {
        id            = "0b2afe49-9f65-41ae-83d2-150544b25195"
        name          = "gost-prod"
        tags          = {
            "Name"      = "gost-prod"
            "Namespace" = "gost-prod"
        }
        # (7 unchanged attributes hidden)

+       rule {
+           name     = "AmazonIpReputationList"
+           priority = 10

+           override_action {

+               none {}
            }

+           statement {

+               managed_rule_group_statement {
+                   name        = "AWSManagedRulesAmazonIpReputationList"
+                   vendor_name = "AWS"
                }
            }

+           visibility_config {
+               cloudwatch_metrics_enabled = false
+               metric_name                = "AmazonIpReputationList-metric"
+               sampled_requests_enabled   = false
            }
        }
+       rule {
+           name     = "AnonymousIpList"
+           priority = 5

+           override_action {

+               none {}
            }

+           statement {

+               managed_rule_group_statement {
+                   name        = "AWSManagedRulesAnonymousIpList"
+                   vendor_name = "AWS"
                }
            }

+           visibility_config {
+               cloudwatch_metrics_enabled = false
+               metric_name                = "AnonymousIpList-metric"
+               sampled_requests_enabled   = false
            }
        }
+       rule {
+           name     = "CommonRuleSet"
+           priority = 20

+           override_action {

+               none {}
            }

+           statement {

+               managed_rule_group_statement {
+                   name        = "AWSManagedRulesCommonRuleSet"
+                   vendor_name = "AWS"
                }
            }

+           visibility_config {
+               cloudwatch_metrics_enabled = true
+               metric_name                = "CommonRuleSet-metric"
+               sampled_requests_enabled   = true
            }
        }
+       rule {
+           name     = "KnownBadInputsRuleSet"
+           priority = 30

+           override_action {

+               none {}
            }

+           statement {

+               managed_rule_group_statement {
+                   name        = "AWSManagedRulesKnownBadInputsRuleSet"
+                   vendor_name = "AWS"
                }
            }

+           visibility_config {
+               cloudwatch_metrics_enabled = true
+               metric_name                = "KnownBadInputsRuleSet-metric"
+               sampled_requests_enabled   = true
            }
        }

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 6 to change, 2 to destroy.
```

</details>

*Pusher: @as1729, Action: `pull_request`, Workflow: `Terraform CI`*